export const treeData = {
    id: "根节点",
    children: [
        {
            id: "一级节点1",
            children: [
                {
                    id: "二级节点1二级节点1二级节点1二级节点1二级节点1-1",
                    children: [
                        { id: "三级节点1三级节点1三级节点1-1-1" },
                        { id: "三级节点1-1-2" },
                    ],
                },
                {
                    id: "二级节点1-2",
                    children: [
                        { id: "三级节点1-2-1" },
                        { id: "三级节点1-2-2" },
                    ],
                },
            ],
        },
        {
            id: "一级节点2",
            children: [
                {
                    id: "二级节点2-1",
                    children: [
                        { id: "三级节点2-1-1" },
                        { id: "三级节点2-1-2" },
                    ],
                },
                {
                    id: "二级节点2-2",
                    children: [
                        { id: "三级节点2-2-1" },
                        { id: "三级节点2-2-2" },
                    ],
                },
            ],
        },
        {
            id: "一级节点3",
            children: [
                {
                    id: "二级节点3-1",
                    children: [
                        { id: "三级节点3-1-1" },
                        { id: "三级节点3-1-2" },
                    ],
                },
                {
                    id: "二级节点3-2",
                    children: [
                        { id: "三级节点3-2-1" },
                        { id: "三级节点3-2-2" },
                    ],
                },
            ],
        },
    ],
};
